import { getEntitiesByPeriod } from '..';
import { DashboardDataDates, DashboardDataEntities } from '../../../model/slice/state-schema';



const startEntities: DashboardDataEntities = {
  1 : { kod: '1',  periodType: 'month', title: 'title-1',  companyType: 'Общая', productType: 'Общая', data: ['1-1', '1-2', '1-3', '1-4', '1-5', '1-6', '1-7', '1-8', '1-9', '1-10', '1-11', '1-12', '1-13', '1-14', '1-15', '1-16', '1-17', '1-18', '1-19', '1-20'] },
  2 : { kod: '2',  periodType: 'month', title: 'title-2',  companyType: 'Общая', productType: 'Общая', data: ['2-1', '2-2', '2-3', '2-4', '2-5', '2-6', '2-7', '2-8', '2-9', '2-10', '2-11', '2-12', '2-13', '2-14', '2-15', '2-16', '2-17', '2-18', '2-19', '2-20'] },
  3 : { kod: '3',  periodType: 'month', title: 'title-3',  companyType: 'Общая', productType: 'Общая', data: ['3-1', '3-2', '3-3', '3-4', '3-5', '3-6', '3-7', '3-8', '3-9', '3-10', '3-11', '3-12', '3-13', '3-14', '3-15', '3-16', '3-17', '3-18', '3-19', '3-20'] },
  4 : { kod: '4',  periodType: 'week', title: 'title-4',  companyType: 'Общая', productType: 'Общая', data: ['4-1', '4-2', '4-3', '4-4', '4-5', '4-6', '4-7', '4-8', '4-9', '4-10', '4-11', '4-12', '4-13', '4-14', '4-15', '4-16', '4-17', '4-18', '4-19', '4-20'] },
  5 : { kod: '5',  periodType: 'month', title: 'title-5',  companyType: 'Общая', productType: 'Общая', data: ['5-1', '5-2', '5-3', '5-4', '5-5', '5-6', '5-7', '5-8', '5-9', '5-10', '5-11', '5-12', '5-13', '5-14', '5-15', '5-16', '5-17', '5-18', '5-19', '5-20'] },
  6 : { kod: '6',  periodType: 'month', title: 'title-6',  companyType: 'Общая', productType: 'Общая', data: ['6-1', '6-2', '6-3', '6-4', '6-5', '6-6', '6-7', '6-8', '6-9', '6-10', '6-11', '6-12', '6-13', '6-14', '6-15', '6-16', '6-17', '6-18', '6-19', '6-20'] },
  7 : { kod: '7',  periodType: 'month', title: 'title-7',  companyType: 'Общая', productType: 'Общая', data: ['7-1', '7-2', '7-3', '7-4', '7-5', '7-6', '7-7', '7-8', '7-9', '7-10', '7-11', '7-12', '7-13', '7-14', '7-15', '7-16', '7-17', '7-18', '7-19', '7-20'] },
  8 : { kod: '8',  periodType: 'month', title: 'title-8',  companyType: 'Общая', productType: 'Общая', data: ['8-1', '8-2', '8-3', '8-4', '8-5', '8-6', '8-7', '8-8', '8-9', '8-10', '8-11', '8-12', '8-13', '8-14', '8-15', '8-16', '8-17', '8-18', '8-19', '8-20'] },
  9 : { kod: '9',  periodType: 'week', title: 'title-9',  companyType: 'Общая', productType: 'Общая', data: ['9-1', '9-2', '9-3', '9-4', '9-5', '9-6', '9-7', '9-8', '9-9', '9-10', '9-11', '9-12', '9-13', '9-14', '9-15', '9-16', '9-17', '9-18', '9-19', '9-20'] },
  10: { kod: '10', periodType: 'week', title: 'title-10', companyType: 'Общая', productType: 'Общая', data: ['10-1', '10-2', '10-3', '10-4', '10-5', '10-6', '10-7', '10-8', '10-9', '10-10', '10-11', '10-12', '10-13', '10-14', '10-15', '10-16', '10-17', '10-18', '10-19', '10-20'] },
  11: { kod: '11', periodType: 'month', title: 'title-11', companyType: 'Общая', productType: 'Общая', data: ['11-1', '11-2', '11-3', '11-4', '11-5', '11-6', '11-7', '11-8', '11-9', '11-10', '11-11', '11-12', '11-13', '11-14', '11-15', '11-16', '11-17', '11-18', '11-19', '11-20'] },
  12: { kod: '12', periodType: 'month', title: 'title-12', companyType: 'Общая', productType: 'Общая', data: ['12-1', '12-2', '12-3', '12-4', '12-5', '12-6', '12-7', '12-8', '12-9', '12-10', '12-11', '12-12', '12-13', '12-14', '12-15', '12-16', '12-17', '12-18', '12-19', '12-20'] },
  13: { kod: '13', periodType: 'month', title: 'title-13', companyType: 'Общая', productType: 'Общая', data: ['13-1', '13-2', '13-3', '13-4', '13-5', '13-6', '13-7', '13-8', '13-9', '13-10', '13-11', '13-12', '13-13', '13-14', '13-15', '13-16', '13-17', '13-18', '13-19', '13-20'] },
  14: { kod: '14', periodType: 'week', title: 'title-14', companyType: 'Общая', productType: 'Общая', data: ['14-1', '14-2', '14-3', '14-4', '14-5', '14-6', '14-7', '14-8', '14-9', '14-10', '14-11', '14-12', '14-13', '14-14', '14-15', '14-16', '14-17', '14-18', '14-19', '14-20'] },
  15: { kod: '15', periodType: 'week', title: 'title-15', companyType: 'Общая', productType: 'Общая', data: ['15-1', '15-2', '15-3', '15-4', '15-5', '15-6', '15-7', '15-8', '15-9', '15-10', '15-11', '15-12', '15-13', '15-14', '15-15', '15-16', '15-17', '15-18', '15-19', '15-20'] },
  16: { kod: '16', periodType: 'month', title: 'title-16', companyType: 'Общая', productType: 'Общая', data: ['16-1', '16-2', '16-3', '16-4', '16-5', '16-6', '16-7', '16-8', '16-9', '16-10', '16-11', '16-12', '16-13', '16-14', '16-15', '16-16', '16-17', '16-18', '16-19', '16-20'] },
  17: { kod: '17', periodType: 'month', title: 'title-17', companyType: 'Общая', productType: 'Общая', data: ['17-1', '17-2', '17-3', '17-4', '17-5', '17-6', '17-7', '17-8', '17-9', '17-10', '17-11', '17-12', '17-13', '17-14', '17-15', '17-16', '17-17', '17-18', '17-19', '17-20'] },
  18: { kod: '18', periodType: 'month', title: 'title-18', companyType: 'Общая', productType: 'Общая', data: ['18-1', '18-2', '18-3', '18-4', '18-5', '18-6', '18-7', '18-8', '18-9', '18-10', '18-11', '18-12', '18-13', '18-14', '18-15', '18-16', '18-17', '18-18', '18-19', '18-20'] },
  19: { kod: '19', periodType: 'month', title: 'title-19', companyType: 'Общая', productType: 'Общая', data: ['19-1', '19-2', '19-3', '19-4', '19-5', '19-6', '19-7', '19-8', '19-9', '19-10', '19-11', '19-12', '19-13', '19-14', '19-15', '19-16', '19-17', '19-18', '19-19', '19-20'] },
  20: { kod: '20', periodType: 'month', title: 'title-20', companyType: 'Общая', productType: 'Общая', data: ['20-1', '20-2', '20-3', '20-4', '20-5', '20-6', '20-7', '20-8', '20-9', '20-10', '20-11', '20-12', '20-13', '20-14', '20-15', '20-16', '20-17', '20-18', '20-19', '20-20'] },
};


const startDates: DashboardDataDates = {
  month : [
    1674669600000, // 1
    1677088800000, // 2
    1680112800000, // 3
    1682532000000, // 4
    1684951200000, // 5
    1687975200000, // 6
    1690394400000, // 7
    1693418400000, // 8 start - 1690491600001
    1695837600000, // 9
    1698256800000, // 10
    1701280800000, // 11
    1703700000000, // 12
    1706119200000, // 13
    1709143200000, // 14
    1711562400000, // 15
    1713981600000, // 16 end - 1714165200001
    1717005600000, // 17
    1719424800000, // 18
    1721844000000, // 19
    1724868000000  // 20
  ],
  week : [
    1682532000000, // 1
    1684951200000, // 2
    1687975200000, // 3
    1690394400000, // 4
    1693418400000, // 5 start - 1690491600001
    1695837600000, // 6
    1698256800000, // 7
    1701280800000, // 8
    1703700000000, // 9
    1706119200000, // 10
    1709143200000, // 11
    1711562400000, // 12
    1713981600000, // 13 end - 1714165200001
    1717005600000, // 14
    1719424800000, // 15
    1721844000000, // 16
    1724868000000, // 17
    1724868000000, // 18
    1724868000000, // 19
    1724868000000  // 20
  ]
};



describe('getEntitiesByPeriod', () => {
  test('valid data', () => {
    expect(getEntitiesByPeriod(startEntities, startDates, {
      start : 1690491600001, // "2023-07-27T21:00:00.001Z"
      end   : 1714165200001  // "2024-04-27T21:00:00.001Z"
    })).toEqual({
      activeEntities: {
        1 : { kod: '1',  periodType: 'month', title: 'title-1',  companyType: 'Общая', productType: 'Общая', data: ['1-8', '1-9', '1-10', '1-11', '1-12', '1-13', '1-14', '1-15', '1-16'] },
        2 : { kod: '2',  periodType: 'month', title: 'title-2',  companyType: 'Общая', productType: 'Общая', data: ['2-8', '2-9', '2-10', '2-11', '2-12', '2-13', '2-14', '2-15', '2-16'] },
        3 : { kod: '3',  periodType: 'month', title: 'title-3',  companyType: 'Общая', productType: 'Общая', data: ['3-8', '3-9', '3-10', '3-11', '3-12', '3-13', '3-14', '3-15', '3-16'] },
        5 : { kod: '5',  periodType: 'month', title: 'title-5',  companyType: 'Общая', productType: 'Общая', data: ['5-8', '5-9', '5-10', '5-11', '5-12', '5-13', '5-14', '5-15', '5-16'] },
        6 : { kod: '6',  periodType: 'month', title: 'title-6',  companyType: 'Общая', productType: 'Общая', data: ['6-8', '6-9', '6-10', '6-11', '6-12', '6-13', '6-14', '6-15', '6-16'] },
        7 : { kod: '7',  periodType: 'month', title: 'title-7',  companyType: 'Общая', productType: 'Общая', data: ['7-8', '7-9', '7-10', '7-11', '7-12', '7-13', '7-14', '7-15', '7-16'] },
        8 : { kod: '8',  periodType: 'month', title: 'title-8',  companyType: 'Общая', productType: 'Общая', data: ['8-8', '8-9', '8-10', '8-11', '8-12', '8-13', '8-14', '8-15', '8-16'] },
        11: { kod: '11', periodType: 'month', title: 'title-11', companyType: 'Общая', productType: 'Общая', data: ['11-8', '11-9', '11-10', '11-11', '11-12', '11-13', '11-14', '11-15', '11-16'] },
        12: { kod: '12', periodType: 'month', title: 'title-12', companyType: 'Общая', productType: 'Общая', data: ['12-8', '12-9', '12-10', '12-11', '12-12', '12-13', '12-14', '12-15', '12-16'] },
        13: { kod: '13', periodType: 'month', title: 'title-13', companyType: 'Общая', productType: 'Общая', data: ['13-8', '13-9', '13-10', '13-11', '13-12', '13-13', '13-14', '13-15', '13-16'] },
        16: { kod: '16', periodType: 'month', title: 'title-16', companyType: 'Общая', productType: 'Общая', data: ['16-8', '16-9', '16-10', '16-11', '16-12', '16-13', '16-14', '16-15', '16-16'] },
        17: { kod: '17', periodType: 'month', title: 'title-17', companyType: 'Общая', productType: 'Общая', data: ['17-8', '17-9', '17-10', '17-11', '17-12', '17-13', '17-14', '17-15', '17-16'] },
        18: { kod: '18', periodType: 'month', title: 'title-18', companyType: 'Общая', productType: 'Общая', data: ['18-8', '18-9', '18-10', '18-11', '18-12', '18-13', '18-14', '18-15', '18-16'] },
        19: { kod: '19', periodType: 'month', title: 'title-19', companyType: 'Общая', productType: 'Общая', data: ['19-8', '19-9', '19-10', '19-11', '19-12', '19-13', '19-14', '19-15', '19-16'] },
        20: { kod: '20', periodType: 'month', title: 'title-20', companyType: 'Общая', productType: 'Общая', data: ['20-8', '20-9', '20-10', '20-11', '20-12', '20-13', '20-14', '20-15', '20-16'] },

        4 : { kod: '4',  periodType: 'week', title: 'title-4',  companyType: 'Общая', productType: 'Общая', data: ['4-5', '4-6', '4-7', '4-8', '4-9', '4-10', '4-11', '4-12', '4-13'] },
        9 : { kod: '9',  periodType: 'week', title: 'title-9',  companyType: 'Общая', productType: 'Общая', data: ['9-5', '9-6', '9-7', '9-8', '9-9', '9-10', '9-11', '9-12', '9-13'] },
        10: { kod: '10', periodType: 'week', title: 'title-10', companyType: 'Общая', productType: 'Общая', data: ['10-5', '10-6', '10-7', '10-8', '10-9', '10-10', '10-11', '10-12', '10-13'] },
        14: { kod: '14', periodType: 'week', title: 'title-14', companyType: 'Общая', productType: 'Общая', data: ['14-5', '14-6', '14-7', '14-8', '14-9', '14-10', '14-11', '14-12', '14-13'] },
        15: { kod: '15', periodType: 'week', title: 'title-15', companyType: 'Общая', productType: 'Общая', data: ['15-5', '15-6', '15-7', '15-8', '15-9', '15-10', '15-11', '15-12', '15-13'] },
      },
      activeDates: {
        month : [
          1693418400000, // 8 start - 1690491600001
          1695837600000, // 9
          1698256800000, // 10
          1701280800000, // 11
          1703700000000, // 12
          1706119200000, // 13
          1709143200000, // 14
          1711562400000, // 15
          1713981600000, // 16 end - 1714165200001
        ],
        week : [
          1693418400000, // 5 start - 1690491600001
          1695837600000, // 6
          1698256800000, // 7
          1701280800000, // 8
          1703700000000, // 9
          1706119200000, // 10
          1709143200000, // 11
          1711562400000, // 12
          1713981600000, // 13 end - 1714165200001
        ]
      },
     });
  });
});
